---
kind: type
id: T:Autodesk.Revit.DB.Visual.Noise
source: html/71c2801a-771b-97ce-3ef4-4c4e0904c5ec.htm
---
# Autodesk.Revit.DB.Visual.Noise

A static class that provides access to the property names that appear in the Noise visual asset schema.

## Syntax (C#)
```csharp
public static class Noise
```